<?php

"Nested" মানে ভেতরের মধ্যে।
যখন আমরা একটি loop এর ভিতরে আরেকটি loop লিখি, তখন তাকে nested loop বলা হয়।

* এটি তখনই দরকার হয়, যখন দুই স্তরের (বা একাধিক স্তরের) ডেটা নিয়ে কাজ করতে হয়, যেমন:

* টেবিলের মত ডেটা প্রিন্ট করতে

* মাল্টি-ডাইমেনশনাল array

* pattern/shape তৈরি করতে

for($i = 1 ; $i <= 1 ; $i++){
    for($j = 1 ; $j <=10 ; $j++){
        echo $i ."x". $j ."=". $i*$j. PHP_EOL ;
    }
    
}

 Output : 1x1=1
          1x2=2
          1x3=3
          1x4=4
          1x5=5
          1x6=6
          1x7=7
          1x8=8
          1x9=9
          1x10=10
